app/Models/MKaryawan.php

SELECT *
FROM `tbl_karyawan`
WHERE `kodekaryawan` = 'USR-001'
---
    public function detail($id)
    {
        return $this->db
            ->table('tbl_karyawan')
            ->where('kodekaryawan', $id)->get()->getRowArray();