app/Models/MLaporan.php

    function getDetailFakturPembelianBahanBaku($kode){
        return $this->db->table('tbl_detail_bahan_baku_masuk')
            ->join('tbl_bahan_baku', 'tbl_detail_bahan_baku_masuk.kode_bahan_baku_detail=tbl_bahan_baku.kode_bahan_baku')
            ->where('kode_bahan_baku_masuk_detail',$kode)
            ->get()->getResultArray();
---
SELECT *
FROM `tbl_detail_bahan_baku_masuk`
JOIN `tbl_bahan_baku` ON `tbl_detail_bahan_baku_masuk`.`kode_bahan_baku_detail`=`tbl_bahan_baku`.`kode_bahan_baku`
WHERE `kode_bahan_baku_masuk_detail` = 'FK-BM-001'

    function getpemesanan($tglawal, $tglakhir)
    {
        return $this->db
            ->table('tbl_pemesanan')
            ->join('pelanggan', 'tbl_pemesanan.kode_pelanggan = pelanggan.kodepelanggan')
            ->join('tbl_penjualan_detail', 'tbl_pemesanan.kode_pemesanan = tbl_penjualan_detail.no_pemesanan_detail')
            ->join('tbl_produk', 'tbl_produk.kode_produk = tbl_penjualan_detail.kode_produk_penjualan_detail')
            ->join('tbl_jenis_tenun', 'tbl_produk.kode_jenis_motif = tbl_jenis_tenun.kode_jenis')
            ->join('level_status', 'kode_status=status_pemesanan')
            ->where('tgl_pemesanan >=', $tglawal)
            ->where('tgl_pemesanan <=', $tglakhir)
            ->get()->getResultArray();
---
SELECT *
FROM `tbl_pemesanan`
JOIN `pelanggan` ON `tbl_pemesanan`.`kode_pelanggan` = `pelanggan`.`kodepelanggan`
JOIN `tbl_penjualan_detail` ON `tbl_pemesanan`.`kode_pemesanan` = `tbl_penjualan_detail`.`no_pemesanan_detail`
JOIN `tbl_produk` ON `tbl_produk`.`kode_produk` = `tbl_penjualan_detail`.`kode_produk_penjualan_detail`
JOIN `tbl_jenis_tenun` ON `tbl_produk`.`kode_jenis_motif` = `tbl_jenis_tenun`.`kode_jenis`
JOIN `level_status` ON `kode_status`=`status_pemesanan`
WHERE `tgl_pemesanan` >= '2023-07-09'
AND `tgl_pemesanan` <= '2023-07-15'

    function detailpelanggan($id)
    {
        return $this->db
            ->table('pelanggan')
            ->where('kodepelanggan', $id)->get()->getRowArray();
---
SELECT *
FROM `pelanggan`
WHERE `kodepelanggan` = 'PL-02'

    function getDetailPemesanan($id)
    {
        return $this->db
            ->table('tbl_pemesanan')
            ->join('tbl_penjualan_detail', 'tbl_pemesanan.kode_pemesanan=tbl_penjualan_detail.no_pemesanan_detail')
            ->join('tbl_produk', 'tbl_produk.kode_produk = tbl_penjualan_detail.kode_produk_penjualan_detail')
            ->join('tbl_jenis_tenun', 'tbl_produk.kode_jenis_motif = tbl_jenis_tenun.kode_jenis')
            ->where('no_pemesanan_detail', $id)->get()->getResultArray();
---
SELECT *
FROM `tbl_pemesanan`
JOIN `tbl_penjualan_detail` ON `tbl_pemesanan`.`kode_pemesanan`=`tbl_penjualan_detail`.`no_pemesanan_detail`
JOIN `tbl_produk` ON `tbl_produk`.`kode_produk` = `tbl_penjualan_detail`.`kode_produk_penjualan_detail`
JOIN `tbl_jenis_tenun` ON `tbl_produk`.`kode_jenis_motif` = `tbl_jenis_tenun`.`kode_jenis`
WHERE `no_pemesanan_detail` = 'FK-PO-001'

    function getDetailPenjualan($id)
    {
        return $this->db
            ->table('tbl_penjualan')
            ->join('tbl_penjualan_detail', 'tbl_penjualan.no_transaksi_penjualan=tbl_penjualan_detail.no_transaksi_penjualan_detail')
            ->join('tbl_produk', 'tbl_produk.kode_produk = tbl_penjualan_detail.kode_produk_penjualan_detail')
            ->join('tbl_jenis_tenun', 'tbl_produk.kode_jenis_motif = tbl_jenis_tenun.kode_jenis')
            ->where('no_transaksi_penjualan_detail', $id)->get()->getResultArray();
---
SELECT *
FROM `tbl_penjualan`
JOIN `tbl_penjualan_detail` ON `tbl_penjualan`.`no_transaksi_penjualan`=`tbl_penjualan_detail`.`no_transaksi_penjualan_detail`
JOIN `tbl_produk` ON `tbl_produk`.`kode_produk` = `tbl_penjualan_detail`.`kode_produk_penjualan_detail`
JOIN `tbl_jenis_tenun` ON `tbl_produk`.`kode_jenis_motif` = `tbl_jenis_tenun`.`kode_jenis`
WHERE `no_transaksi_penjualan_detail` = 'FK-PJ-001'

    function getProduksi($tglawal, $tglakhir)
    {
        return $this->db
            ->table('tbl_produksi_detail')
            ->join('tbl_produksi', 'tbl_produksi_detail.kode_produksi_detail=tbl_produksi.kode_produksi')
            ->join('tbl_produk', 'tbl_produksi.kode_produk=tbl_produk.kode_produk')
            ->join('tbl_jenis_tenun', 'tbl_jenis_tenun.kode_jenis=tbl_produk.kode_jenis_motif')
            ->join('tbl_bahan_baku', 'tbl_bahan_baku.kode_bahan_baku = tbl_produksi_detail.kode_bahan_baku_detail')
            ->where('tbl_produksi_detail.created_at >=', $tglawal)
            ->where('tbl_produksi_detail.created_at <=', $tglakhir)
            ->get()->getResultArray();
---
SELECT *
FROM `tbl_produksi_detail`
JOIN `tbl_produksi` ON `tbl_produksi_detail`.`kode_produksi_detail`=`tbl_produksi`.`kode_produksi`
JOIN `tbl_produk` ON `tbl_produksi`.`kode_produk`=`tbl_produk`.`kode_produk`
JOIN `tbl_jenis_tenun` ON `tbl_jenis_tenun`.`kode_jenis`=`tbl_produk`.`kode_jenis_motif`
JOIN `tbl_bahan_baku` ON `tbl_bahan_baku`.`kode_bahan_baku` = `tbl_produksi_detail`.`kode_bahan_baku_detail`
WHERE `tbl_produksi_detail`.`created_at` >= '2023-07-01'
AND `tbl_produksi_detail`.`created_at` <= '2023-07-31'