app/Models/MPelanggan.php

SELECT *
FROM `pelanggan`
JOIN `tbl_jeniskelamin` ON `kodejenkel`=`kode_jenkel`
---
    function getAlldata()
    {
        return $this->db
        ->table('pelanggan')
        ->join('tbl_jeniskelamin','kodejenkel=kode_jenkel')
        ->get()
        ->getResultArray();

SELECT *
FROM `pelanggan`
WHERE `kodepelanggan` = 'PL-01'
---
    public function detail($id)
    {
        return $this->db
            ->table('pelanggan')
            ->where('kodepelanggan', $id)->get()->getRowArray();