app/Models/MPembelianBahanBaku.php

SELECT *
FROM `tbl_detail_bahan_baku_masuk`
JOIN `tbl_bahan_baku` ON `tbl_detail_bahan_baku_masuk`.`kode_bahan_baku_detail`=`tbl_bahan_baku`.`kode_bahan_baku`
WHERE `kode_bahan_baku_masuk_detail` = 'FK-BM-001'
---
    function getDetail($id)
    {
        return $this->db->table('tbl_detail_bahan_baku_masuk')
            ->join('tbl_bahan_baku', 'tbl_detail_bahan_baku_masuk.kode_bahan_baku_detail=tbl_bahan_baku.kode_bahan_baku')
            ->where('kode_bahan_baku_masuk_detail',$id)
            ->get()->getResultArray();