app/Models/MPemesanan.php

    function koderandom()
    {
        $kode = $this->db->table('tbl_pemesanan')
            ->select('RIGHT(kode_pemesanan,3) as iduser', false)
            ->orderBy('iduser', 'DESC')
            ->limit(1)
            ->get()->getRowArray();
---
SELECT RIGHT(kode_pemesanan,3) as iduser
FROM `tbl_pemesanan`
ORDER BY `iduser` DESC
 LIMIT 1

    function getstatus()
    {
        return $this->db->table('level_status')->get()->getResultArray();
---
SELECT *
FROM `level_status`

    public function getAllData()
    {
        return $this->db
            ->table('tbl_pemesanan')
            ->join('pelanggan', 'tbl_pemesanan.kode_pelanggan = pelanggan.kodepelanggan')
            ->join('tbl_penjualan_detail', 'tbl_pemesanan.kode_pemesanan = tbl_penjualan_detail.no_pemesanan_detail')
            ->join('tbl_produk', 'tbl_produk.kode_produk = tbl_penjualan_detail.kode_produk_penjualan_detail')
            ->join('tbl_jenis_tenun', 'tbl_produk.kode_jenis_motif = tbl_jenis_tenun.kode_jenis')
            ->join('level_status', 'kode_status=status_pemesanan')
            ->get()->getResultArray();
---
SELECT *
FROM `tbl_penjualan_detail`
JOIN `tbl_produk` ON `tbl_produk`.`kode_produk` = `tbl_penjualan_detail`.`kode_produk_penjualan_detail`
JOIN `tbl_jenis_tenun` ON `tbl_produk`.`kode_jenis_motif` = `tbl_jenis_tenun`.`kode_jenis`
WHERE `no_pemesanan_detail` = 'FK-PO-002'
SELECT *
FROM `tbl_pemesanan`
JOIN `pelanggan` ON `tbl_pemesanan`.`kode_pelanggan` = `pelanggan`.`kodepelanggan`
JOIN `tbl_penjualan_detail` ON `tbl_pemesanan`.`kode_pemesanan` = `tbl_penjualan_detail`.`no_pemesanan_detail`
JOIN `tbl_produk` ON `tbl_produk`.`kode_produk` = `tbl_penjualan_detail`.`kode_produk_penjualan_detail`
JOIN `tbl_jenis_tenun` ON `tbl_produk`.`kode_jenis_motif` = `tbl_jenis_tenun`.`kode_jenis`
JOIN `level_status` ON `kode_status`=`status_pemesanan`

    function getDetailBayar($id)
    {
        return $this->db
            ->table('tbl_penjualan_detail')
            ->join('tbl_produk', 'tbl_produk.kode_produk = tbl_penjualan_detail.kode_produk_penjualan_detail')
            ->join('tbl_pemesanan','tbl_pemesanan.kode_pemesanan=tbl_penjualan_detail.no_pemesanan_detail')
            ->join('tbl_jenis_tenun', 'tbl_produk.kode_jenis_motif = tbl_jenis_tenun.kode_jenis')
            ->where('no_pemesanan_detail', $id)->get()->getResultArray();
---
SELECT *
FROM `tbl_penjualan_detail`
JOIN `tbl_produk` ON `tbl_produk`.`kode_produk` = `tbl_penjualan_detail`.`kode_produk_penjualan_detail`
JOIN `tbl_pemesanan` ON `tbl_pemesanan`.`kode_pemesanan`=`tbl_penjualan_detail`.`no_pemesanan_detail`
JOIN `tbl_jenis_tenun` ON `tbl_produk`.`kode_jenis_motif` = `tbl_jenis_tenun`.`kode_jenis`
WHERE `no_pemesanan_detail` = 'FK-PO-009'

    function getDetailPemesanan()
    {
        $id = $this->koderandom();
        return $this->db
            ->table('tbl_penjualan_detail')
            ->join('tbl_produk', 'tbl_produk.kode_produk = tbl_penjualan_detail.kode_produk_penjualan_detail')
            ->join('tbl_jenis_tenun', 'tbl_produk.kode_jenis_motif = tbl_jenis_tenun.kode_jenis')
            ->where('no_pemesanan_detail', $id)->get()->getResultArray();
---
SELECT *
FROM `tbl_penjualan_detail`
JOIN `tbl_produk` ON `tbl_produk`.`kode_produk` = `tbl_penjualan_detail`.`kode_produk_penjualan_detail`
JOIN `tbl_jenis_tenun` ON `tbl_produk`.`kode_jenis_motif` = `tbl_jenis_tenun`.`kode_jenis`
WHERE `no_pemesanan_detail` = 'FK-PO-022'

    public function insert_data($data)
    {
        return $this->db->table('tbl_pemesanan')->insert($data);
---
INSERT INTO `tbl_pemesanan` (`kode_pemesanan`, `tgl_pemesanan`, `kode_pelanggan`, `status_pemesanan`, `created_at`) VALUES ('FK-PO-009', '2023-07-19', 'PL-03', '1', '2023-07-19:12:48:00')

    public function update_data($data, $id)
    {
        return $this->db->table('tbl_pemesanan')->update($data, ['kode_pemesanan' => $id]);
---
UPDATE `tbl_pemesanan` SET `bukti_sisa` = '003.jpg', `bayar_sisa` = '350000', `status_pemesanan` = '3', `updated_at` = '2023-09-14:20:59:57'
WHERE `kode_pemesanan` = 'FK-PO-020'