app/Models/MPenjualan.php

    function koderandom()
    {
        $kode = $this->db->table('tbl_penjualan')
            ->select('RIGHT(no_transaksi_penjualan,3) as iduser', false)
            ->orderBy('iduser', 'DESC')
            ->limit(1)
            ->get()->getRowArray();
---
SELECT RIGHT(no_transaksi_penjualan,3) as iduser
FROM `tbl_penjualan`
ORDER BY `iduser` DESC
 LIMIT 1

    public function getAllData()
    {
        return $this->db
            ->table('tbl_penjualan')
            ->join('tbl_penjualan_detail', 'tbl_penjualan.no_transaksi_penjualan = tbl_penjualan_detail.no_transaksi_penjualan_detail')
            ->join('pelanggan', 'tbl_penjualan.kode_pelanggan = pelanggan.kodepelanggan')
            ->join('tbl_produk', 'tbl_produk.kode_produk = tbl_penjualan_detail.kode_produk_penjualan_detail')
            ->join('tbl_jenis_tenun', 'tbl_produk.kode_jenis_motif = tbl_jenis_tenun.kode_jenis')
            ->get()->getResultArray();
---
SELECT *
FROM `tbl_penjualan`
JOIN `tbl_penjualan_detail` ON `tbl_penjualan`.`no_transaksi_penjualan` = `tbl_penjualan_detail`.`no_transaksi_penjualan_detail`
JOIN `pelanggan` ON `tbl_penjualan`.`kode_pelanggan` = `pelanggan`.`kodepelanggan`
JOIN `tbl_produk` ON `tbl_produk`.`kode_produk` = `tbl_penjualan_detail`.`kode_produk_penjualan_detail`
JOIN `tbl_jenis_tenun` ON `tbl_produk`.`kode_jenis_motif` = `tbl_jenis_tenun`.`kode_jenis`

    function getDetailPemesanan()
    {
        $id = $this->koderandom();
        return $this->db
            ->table('tbl_penjualan_detail')
            ->join('tbl_produk', 'tbl_produk.kode_produk = tbl_penjualan_detail.kode_produk_penjualan_detail')
            ->join('tbl_jenis_tenun', 'tbl_produk.kode_jenis_motif = tbl_jenis_tenun.kode_jenis')
            ->where('no_pemesanan_detail', $id)->get()->getResultArray();
---
SELECT *
FROM `tbl_penjualan_detail`
JOIN `tbl_produk` ON `tbl_produk`.`kode_produk` = `tbl_penjualan_detail`.`kode_produk_penjualan_detail`
JOIN `tbl_jenis_tenun` ON `tbl_produk`.`kode_jenis_motif` = `tbl_jenis_tenun`.`kode_jenis`
WHERE `no_pemesanan_detail` = 'FK-PJ-001'