app/Models/MProduk.php

SELECT *
FROM `produk`
---
    function getAlldata()
    {
        return $this->db->table('produk')->get()->getResultArray();