app/Models/MProduk.php

SELECT *
FROM `tbl_produk`
JOIN `tbl_jenis_tenun` ON `tbl_jenis_tenun`.`kode_jenis`=`tbl_produk`.`kode_jenis_motif`
---
    function getAlldata()
    {
        return $this->db
        ->table('tbl_produksi')
        ->join('tbl_jenis_tenun','tbl_jenis_tenun.kode_jenis=tbl_produksi.kode_jenis_motif')
        ->get()->getResultArray();

SELECT *
FROM `tbl_produksi`
JOIN `tbl_jenis_tenun` ON `tbl_jenis_tenun`.`kode_jenis`=`tbl_produksi`.`kode_jenis_motif`
WHERE `kode_produksi` = 'PR-01'
---
    public function detail($id)
    {
        return $this->db
            ->table('tbl_produksi')
            ->join('tbl_jenis_tenun','tbl_jenis_tenun.kode_jenis=tbl_produksi.kode_jenis_motif')
            ->where('kode_produksi', $id)->get()->getRowArray();