app/Models/MUser.php

    function getAlldata()
    {
        return $this->db
        ->table('user')
        ->orderBy('username','ASC')
        ->get()
        ->getResultArray();
---
SELECT *
FROM `user`
ORDER BY `username` ASC

    function getDataLevel(){
        return $this->db->table('level_user')->get()->getResultArray();
---
SELECT *
FROM `user`

    public function detail($id)
    {
        return $this->db
            ->table('user')
            ->join('tbl_karyawan','kodekaryawan=kode_user','LEFT')
            ->join('pelanggan','kodepelanggan=kode_user','LEFT')
            ->where('kode_user', $id)->get()->getRowArray();
---
SELECT *
FROM `user`
JOIN `tbl_karyawan` ON `kodekaryawan`=`kode_user`
WHERE `kode_user` = 'USR-001'

    public function ceklogin($username)
    {
        return $this->db->table('user')
            ->where(array('username' => $username))
            ->get()->getRowArray();
---
SELECT *
FROM `user`
WHERE `username` = 'admin'